stevenj/avr-libc3/include/avr/io/atmega6490.h
/* LCD Prescaler Selects */
typedef enum LCD_LCDPS_enum
{
    LCD_LCDPS_VAL_0x00_gc = (0x00<<4), /* ClkLCD/16 */
    LCD_LCDPS_VAL_0x01_gc = (0x01<<4), /* ClkLCD/64 */
    LCD_LCDPS_VAL_0x02_gc = (0x02<<4), /* ClkLCD/128 */
    LCD_LCDPS_VAL_0x03_gc = (0x03<<4), /* ClkLCD/256 */
    LCD_LCDPS_VAL_0x04_gc = (0x04<<4), /* ClkLCD/512 */
    LCD_LCDPS_VAL_0x05_gc = (0x05<<4), /* ClkLCD/1024 */
    LCD_LCDPS_VAL_0x06_gc = (0x06<<4), /* ClkLCD/2048 */
    LCD_LCDPS_VAL_0x07_gc = (0x07<<4), /* ClkLCD/4096 */
} LCD_LCDPS_t;

/* LCD Clock Dividers */
typedef enum LCD_LCDCD_enum
{
    LCD_LCDCD_VAL_0x00_gc = (0x00), /* 1 */
    LCD_LCDCD_VAL_0x01_gc = (0x01), /* 2 */
    LCD_LCDCD_VAL_0x02_gc = (0x02), /* 3 */
    LCD_LCDCD_VAL_0x03_gc = (0x03), /* 4 */
    LCD_LCDCD_VAL_0x04_gc = (0x04), /* 5 */
    LCD_LCDCD_VAL_0x05_gc = (0x05), /* 6 */
    LCD_LCDCD_VAL_0x06_gc = (0x06), /* 7 */
    LCD_LCDCD_VAL_0x07_gc = (0x07), /* 8 */
} LCD_LCDCD_t;

/* LCD CLock Select */
typedef enum LCD_LCDCS_enum
{
    LCD_LCDCS_CLEAR_gc = (0x00), /* LCD CLock Select - CLEAR */
    LCD_LCDCS_SET_gc   = (0x80), /* LCD CLock Select - SET */
} LCD_LCDCS_t;

/* LCD 1/2 Bias Select */
typedef enum LCD_LCD2B_enum
{
    LCD_LCD2B_CLEAR_gc = (0x00), /* LCD 1/2 Bias Select - CLEAR */
    LCD_LCD2B_SET_gc   = (0x40), /* LCD 1/2 Bias Select - SET */
} LCD_LCD2B_t;

/* LCD Mux Selects */
#define LCD_LCDCRB_LCDMUX_gc(x) ((x<<4) & 0x30)

/* LCD Port Masks */
typedef enum LCD_LCDPM_enum
{
    LCD_LCDPM_VAL_0x00_gc = (0x00), /* SEG0:12 */
    LCD_LCDPM_VAL_0x01_gc = (0x01), /* SEG0:14 */
    LCD_LCDPM_VAL_0x02_gc = (0x02), /* SEG0:15 */
    LCD_LCDPM_VAL_0x03_gc = (0x03), /* SEG0:18 */
    LCD_LCDPM_VAL_0x04_gc = (0x04), /* SEG0:20 */
    LCD_LCDPM_VAL_0x05_gc = (0x05), /* SEG0:22 */
    LCD_LCDPM_VAL_0x06_gc = (0x06), /* SEG0:23 */
    LCD_LCDPM_VAL_0x07_gc = (0x07), /* SEG0:24 */
    LCD_LCDPM_VAL_0x08_gc = (0x08), /* SEG0:26 */
    LCD_LCDPM_VAL_0x09_gc = (0x09), /* SEG0:28 */
    LCD_LCDPM_VAL_0x0A_gc = (0x0A), /* SEG0:30 */
    LCD_LCDPM_VAL_0x0B_gc = (0x0B), /* SEG0:32 */
    LCD_LCDPM_VAL_0x0C_gc = (0x0C), /* SEG0:34 */
    LCD_LCDPM_VAL_0x0D_gc = (0x0D), /* SEG0:36 */
    LCD_LCDPM_VAL_0x0E_gc = (0x0E), /* SEG0:38 */
    LCD_LCDPM_VAL_0x0F_gc = (0x0F), /* SEG0:39 */
} LCD_LCDPM_t;

/* LCD Enable */
typedef enum LCD_LCDEN_enum
{
    LCD_LCDEN_CLEAR_gc = (0x00), /* LCD Enable - CLEAR */
    LCD_LCDEN_SET_gc   = (0x80), /* LCD Enable - SET */
} LCD_LCDEN_t;

/* LCD A or B waveform */
typedef enum LCD_LCDAB_enum
{
    LCD_LCDAB_CLEAR_gc = (0x00), /* LCD A or B waveform - CLEAR */
    LCD_LCDAB_SET_gc   = (0x40), /* LCD A or B waveform - SET */
} LCD_LCDAB_t;

/* LCD Interrupt Flag */
typedef enum LCD_LCDIF_enum
{
    LCD_LCDIF_CLEAR_gc = (0x00), /* LCD Interrupt Flag - CLEAR */
    LCD_LCDIF_SET_gc   = (0x10), /* LCD Interrupt Flag - SET */
} LCD_LCDIF_t;

/* LCD Interrupt Enable */
typedef enum LCD_LCDIE_enum
{
    LCD_LCDIE_CLEAR_gc = (0x00), /* LCD Interrupt Enable - CLEAR */
    LCD_LCDIE_SET_gc   = (0x08), /* LCD Interrupt Enable - SET */
} LCD_LCDIE_t;

/* LCD Blanking */
typedef enum LCD_LCDBL_enum
{
    LCD_LCDBL_CLEAR_gc = (0x00), /* LCD Blanking - CLEAR */
    LCD_LCDBL_SET_gc   = (0x01), /* LCD Blanking - SET */
} LCD_LCDBL_t;

/*
--------------------------------------------------------------------------------
EXINT - External Interrupts
--------------------------------------------------------------------------------
*/

typedef struct EXINT_struct
{
    register8_t rsv_0x00[60]; /* RESERVED REGISTER BLOCK */
    register8_t EIFR;         /* External Interrupt Flag Register */
    register8_t EIMSK;        /* External Interrupt Mask Register */
    register8_t rsv_0x3E[43]; /* RESERVED REGISTER BLOCK */
    register8_t EICRA;        /* External Interrupt Control Register A */
    register8_t rsv_0x6A;     /* RESERVED REGISTER */
    register8_t PCMSK0;       /* Pin Change Mask Register 0 */
    register8_t PCMSK1;       /* Pin Change Mask Register 1 */
    register8_t PCMSK2;       /* Pin Change Mask Register 2 */
    register8_t rsv_0x6E[5];  /* RESERVED REGISTER BLOCK */
    register8_t PCMSK3;       /* Pin Change Mask Register 3 */
} EXINT_t;


/* External Interrupt Sense Control 0 Bit 1 */
typedef enum EXINT_ISC01_enum
{
    EXINT_ISC01_CLEAR_gc = (0x00), /* External Interrupt Sense Control 0 Bit 1 - CLEAR */
    EXINT_ISC01_SET_gc   = (0x02), /* External Interrupt Sense Control 0 Bit 1 - SET */
} EXINT_ISC01_t;

/* External Interrupt Sense Control 0 Bit 0 */
typedef enum EXINT_ISC00_enum
{
    EXINT_ISC00_VAL_0x00_gc = (0x00), /* Low Level of INTX */
    EXINT_ISC00_VAL_0x01_gc = (0x01), /* Any Logical Change of INTX */
    EXINT_ISC00_VAL_0x02_gc = (0x02), /* Falling Edge of INTX */
    EXINT_ISC00_VAL_0x03_gc = (0x03), /* Rising Edge of INTX */
} EXINT_ISC00_t;

/* Pin Change Interrupt Enables */
#define EXINT_EIMSK_PCIE_gc(x) ((x<<4) & 0xF0)

/* External Interrupt Request 0 Enable */
typedef enum EXINT_INT0_enum
{
    EXINT_INT0_CLEAR_gc = (0x00), /* External Interrupt Request 0 Enable - CLEAR */
    EXINT_INT0_SET_gc   = (0x01), /* External Interrupt Request 0 Enable - SET */
} EXINT_INT0_t;

/* Pin Change Interrupt Flags */
#define EXINT_EIFR_PCIF_gc(x) ((x<<4) & 0xF0)

/* External Interrupt Flag 0 */
typedef enum EXINT_INTF0_enum
{
    EXINT_INTF0_CLEAR_gc = (0x00), /* External Interrupt Flag 0 - CLEAR */
    EXINT_INTF0_SET_gc   = (0x01), /* External Interrupt Flag 0 - SET */
} EXINT_INTF0_t;
/*
================================================================================
IO Module Instances. Mapped to memory.
================================================================================
*/

#define ADC       (*(ADC_t *) 0x0000)       /* Analog-to-Digital Converter */
#define AC        (*(AC_t *) 0x0000)        /* Analog Comparator */
#define SPI       (*(SPI_t *) 0x0000)       /* Serial Peripheral Interface */
#define USI       (*(USI_t *) 0x0000)       /* Universal Serial Interface */
#define USART0    (*(USART0_t *) 0x0000)    /* USART */
#define CPU       (*(CPU_t *) 0x0000)       /* CPU Registers */
#define JTAG      (*(JTAG_t *) 0x0000)      /* JTAG Interface */
#define EEPROM    (*(EEPROM_t *) 0x0000)    /* EEPROM */
#define PORTA     (*(PORTA_t *) 0x0000)     /* I/O Port */
#define PORTB     (*(PORTB_t *) 0x0000)     /* I/O Port */
#define PORTC     (*(PORTC_t *) 0x0000)     /* I/O Port */
#define PORTD     (*(PORTD_t *) 0x0000)     /* I/O Port */
#define PORTE     (*(PORTE_t *) 0x0000)     /* I/O Port */
#define PORTF     (*(PORTF_t *) 0x0000)     /* I/O Port */
#define PORTG     (*(PORTG_t *) 0x0000)     /* I/O Port */
#define PORTH     (*(PORTH_t *) 0x0000)     /* I/O Port */
#define PORTJ     (*(PORTJ_t *) 0x0000)     /* I/O Port */
#define TC0       (*(TC0_t *) 0x0000)       /* Timer/Counter, 8-bit */
#define TC1       (*(TC1_t *) 0x0000)       /* Timer/Counter, 16-bit */
#define TC2       (*(TC2_t *) 0x0000)       /* Timer/Counter, 8-bit Async */
#define WDT       (*(WDT_t *) 0x0000)       /* Watchdog Timer */
#define BOOT_LOAD (*(BOOT_LOAD_t *) 0x0000) /* Bootloader */
#define LCD       (*(LCD_t *) 0x0000)       /* Liquid Crystal Display */
#define EXINT     (*(EXINT_t *) 0x0000)     /* External Interrupts */
#define FUSE      (*(FUSE_t *) 0x0000)      /* Fuses */
#define LOCKBIT   (*(LOCKBIT_t *) 0x0000)   /* Lockbits */
#else
/*
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
ASM LANGUAGE - ONLY
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
*/


