stevenj/avr-libc3/include/avr/io/atmega6490.h
/*
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
C/ASM COMMON DEFINITIONS
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
*/

/*
================================================================================
Flattened fully qualified IO register names
================================================================================
*/


/* ADC - Analog-to-Digital Converter (0x00) */
#define ADC_BASE         _SFR_MEM16(0x00) /* ADC Base Address */
#define ADC_ADC          _SFR_MEM16(0x78) /* ADC Data Register  Bytes */
#define ADC_ADCL         _SFR_MEM8 (0x78) /* ADC Data Register  Bytes LOW BYTE */
#define ADC_ADCH         _SFR_MEM8 (0x79) /* ADC Data Register  Bytes HIGH BYTE */
#define ADC_ADCSRA       _SFR_MEM8 (0x7A) /* The ADC Control and Status register */
#define ADC_ADCSRB       _SFR_MEM8 (0x7B) /* ADC Control and Status Register B */
#define ADC_ADMUX        _SFR_MEM8 (0x7C) /* The ADC multiplexer Selection Register */
#define ADC_DIDR0        _SFR_MEM8 (0x7E) /* Digital Input Disable Register 0 */

/* AC - Analog Comparator (0x00) */
#define AC_BASE          _SFR_MEM8 (0x00) /* AC Base Address */
#define AC_ACSR          _SFR_MEM8 (0x50) /* Analog Comparator Control And Status Register */
#define AC_ADCSRB        _SFR_MEM8 (0x7B) /* ADC Control and Status Register B */
#define AC_DIDR1         _SFR_MEM8 (0x7F) /* Digital Input Disable Register 1 */

/* SPI - Serial Peripheral Interface (0x00) */
#define SPI_BASE         _SFR_MEM8 (0x00) /* SPI Base Address */
#define SPI_SPCR         _SFR_MEM8 (0x4C) /* SPI Control Register */
#define SPI_SPSR         _SFR_MEM8 (0x4D) /* SPI Status Register */
#define SPI_SPDR         _SFR_MEM8 (0x4E) /* SPI Data Register */

/* USI - Universal Serial Interface (0x00) */
#define USI_BASE         _SFR_MEM8 (0x00) /* USI Base Address */
#define USI_USICR        _SFR_MEM8 (0xB8) /* USI Control Register */
#define USI_USISR        _SFR_MEM8 (0xB9) /* USI Status Register */
#define USI_USIDR        _SFR_MEM8 (0xBA) /* USI Data Register */

/* USART0 - USART (0x00) */
#define USART00_BASE     _SFR_MEM8 (0x00) /* USART00 Base Address */
#define USART00_UCSR0A   _SFR_MEM8 (0xC0) /* USART Control and Status Register A */
#define USART00_UCSR0B   _SFR_MEM8 (0xC1) /* USART Control and Status Register B */
#define USART00_UCSR0C   _SFR_MEM8 (0xC2) /* USART Control and Status Register C */
#define USART00_UBRR0    _SFR_MEM16(0xC4) /* USART Baud Rate Register  Bytes */
#define USART00_UBRR0L   _SFR_MEM8 (0xC4) /* USART Baud Rate Register  Bytes LOW BYTE */
#define USART00_UBRR0H   _SFR_MEM8 (0xC5) /* USART Baud Rate Register  Bytes HIGH BYTE */
#define USART00_UDR0     _SFR_MEM8 (0xC6) /* USART I/O Data Register */

/* CPU - CPU Registers (0x00) */
#define CPU_BASE         _SFR_MEM8 (0x00) /* CPU Base Address */
#define CPU_GPIOR0       _SFR_MEM8 (0x3E) /* General Purpose IO Register 0 */
#define CPU_GPIOR1       _SFR_MEM8 (0x4A) /* General Purpose IO Register 1 */
#define CPU_GPIOR2       _SFR_MEM8 (0x4B) /* General Purpose IO Register 2 */
#define CPU_SMCR         _SFR_MEM8 (0x53) /* Sleep Mode Control Register */
#define CPU_MCUSR        _SFR_MEM8 (0x54) /* MCU Status Register */
#define CPU_MCUCR        _SFR_MEM8 (0x55) /* MCU Control Register */
#define CPU_SP           _SFR_MEM16(0x5D) /* Stack Pointer  */
#define CPU_SPL          _SFR_MEM8 (0x5D) /* Stack Pointer  LOW BYTE */
#define CPU_SPH          _SFR_MEM8 (0x5E) /* Stack Pointer  HIGH BYTE */
#define CPU_SREG         _SFR_MEM8 (0x5F) /* Status Register */
#define CPU_CLKPR        _SFR_MEM8 (0x61) /* Clock Prescale Register */
#define CPU_PRR          _SFR_MEM8 (0x64) /* Power Reduction Register */
#define CPU_OSCCAL       _SFR_MEM8 (0x66) /* Oscillator Calibration Value */

/* JTAG - JTAG Interface (0x00) */
#define JTAG_BASE        _SFR_MEM8 (0x00) /* JTAG Base Address */
#define JTAG_OCDR        _SFR_MEM8 (0x51) /* On-Chip Debug Related Register in I/O Memory */
#define JTAG_MCUSR       _SFR_MEM8 (0x54) /* MCU Status Register */
#define JTAG_MCUCR       _SFR_MEM8 (0x55) /* MCU Control Register */

/* EEPROM - EEPROM (0x00) */
#define EEPROM_BASE      _SFR_MEM8 (0x00) /* EEPROM Base Address */
#define EEPROM_EECR      _SFR_MEM8 (0x3F) /* EEPROM Control Register */
#define EEPROM_EEDR      _SFR_MEM8 (0x40) /* EEPROM Data Register */
#define EEPROM_EEAR      _SFR_MEM16(0x41) /* EEPROM Read/Write Access  Bytes */
#define EEPROM_EEARL     _SFR_MEM8 (0x41) /* EEPROM Read/Write Access  Bytes LOW BYTE */
#define EEPROM_EEARH     _SFR_MEM8 (0x42) /* EEPROM Read/Write Access  Bytes HIGH BYTE */

/* PORTA - I/O Port (0x00) */
#define PORTAA_BASE      _SFR_MEM8 (0x00) /* PORTAA Base Address */
#define PORTAA_PINA      _SFR_MEM8 (0x20) /* Port A Input Pins */
#define PORTAA_DDRA      _SFR_MEM8 (0x21) /* Port A Data Direction Register */
#define PORTAA_PORTA     _SFR_MEM8 (0x22) /* Port A Data Register */

/* PORTB - I/O Port (0x00) */
#define PORTBB_BASE      _SFR_MEM8 (0x00) /* PORTBB Base Address */
#define PORTBB_PINB      _SFR_MEM8 (0x23) /* Port B Input Pins */
#define PORTBB_DDRB      _SFR_MEM8 (0x24) /* Port B Data Direction Register */
#define PORTBB_PORTB     _SFR_MEM8 (0x25) /* Port B Data Register */

/* PORTC - I/O Port (0x00) */
#define PORTCC_BASE      _SFR_MEM8 (0x00) /* PORTCC Base Address */
#define PORTCC_PINC      _SFR_MEM8 (0x26) /* Port C Input Pins */
#define PORTCC_DDRC      _SFR_MEM8 (0x27) /* Port C Data Direction Register */
#define PORTCC_PORTC     _SFR_MEM8 (0x28) /* Port C Data Register */

/* PORTD - I/O Port (0x00) */
#define PORTDD_BASE      _SFR_MEM8 (0x00) /* PORTDD Base Address */
#define PORTDD_PIND      _SFR_MEM8 (0x29) /* Port D Input Pins */
#define PORTDD_DDRD      _SFR_MEM8 (0x2A) /* Port D Data Direction Register */
#define PORTDD_PORTD     _SFR_MEM8 (0x2B) /* Port D Data Register */

/* PORTE - I/O Port (0x00) */
#define PORTEE_BASE      _SFR_MEM8 (0x00) /* PORTEE Base Address */
#define PORTEE_PINE      _SFR_MEM8 (0x2C) /* Input Pins, Port E */
#define PORTEE_DDRE      _SFR_MEM8 (0x2D) /* Data Direction Register, Port E */
#define PORTEE_PORTE     _SFR_MEM8 (0x2E) /* Data Register, Port E */

/* PORTF - I/O Port (0x00) */
#define PORTFF_BASE      _SFR_MEM8 (0x00) /* PORTFF Base Address */
#define PORTFF_PINF      _SFR_MEM8 (0x2F) /* Input Pins, Port F */
#define PORTFF_DDRF      _SFR_MEM8 (0x30) /* Data Direction Register, Port F */
#define PORTFF_PORTF     _SFR_MEM8 (0x31) /* Data Register, Port F */

/* PORTG - I/O Port (0x00) */
#define PORTGG_BASE      _SFR_MEM8 (0x00) /* PORTGG Base Address */
#define PORTGG_PING      _SFR_MEM8 (0x32) /* Port G Input Pins */
#define PORTGG_DDRG      _SFR_MEM8 (0x33) /* Port G Data Direction Register */
#define PORTGG_PORTG     _SFR_MEM8 (0x34) /* Port G Data Register */

/* PORTH - I/O Port (0x00) */
#define PORTHH_BASE      _SFR_MEM8 (0x00) /* PORTHH Base Address */
#define PORTHH_PINH      _SFR_MEM8 (0xD8) /* PORT H Input Pins */
#define PORTHH_DDRH      _SFR_MEM8 (0xD9) /* PORT H Data Direction Register */
#define PORTHH_PORTH     _SFR_MEM8 (0xDA) /* PORT H Data Register */

/* PORTJ - I/O Port (0x00) */
#define PORTJJ_BASE      _SFR_MEM8 (0x00) /* PORTJJ Base Address */
#define PORTJJ_PINJ      _SFR_MEM8 (0xDB) /* PORT J Input Pins */
#define PORTJJ_DDRJ      _SFR_MEM8 (0xDC) /* PORT J Data Direction Register */
#define PORTJJ_PORTJ     _SFR_MEM8 (0xDD) /* PORT J Data Register */

/* TC0 - Timer/Counter, 8-bit (0x00) */
#define TC8_BASE         _SFR_MEM8 (0x00) /* TC8 Base Address */
#define TC8_TIFR0        _SFR_MEM8 (0x35) /* Timer/Counter0 Interrupt Flag register */
#define TC8_GTCCR        _SFR_MEM8 (0x43) /* General Timer/Control Register */
#define TC8_TCCR0A       _SFR_MEM8 (0x44) /* Timer/Counter0 Control Register */
#define TC8_TCNT0        _SFR_MEM8 (0x46) /* Timer/Counter0 */
#define TC8_OCR0A        _SFR_MEM8 (0x47) /* Timer/Counter0 Output Compare Register */
#define TC8_TIMSK0       _SFR_MEM8 (0x6E) /* Timer/Counter0 Interrupt Mask Register */

/* TC1 - Timer/Counter, 16-bit (0x00) */
#define TC16_BASE        _SFR_MEM8 (0x00) /* TC16 Base Address */
#define TC16_TIFR1       _SFR_MEM8 (0x36) /* Timer/Counter1 Interrupt Flag register */
#define TC16_TIMSK1      _SFR_MEM8 (0x6F) /* Timer/Counter1 Interrupt Mask Register */
#define TC16_TCCR1A      _SFR_MEM8 (0x80) /* Timer/Counter1 Control Register A */
#define TC16_TCCR1B      _SFR_MEM8 (0x81) /* Timer/Counter1 Control Register B */
#define TC16_TCCR1C      _SFR_MEM8 (0x82) /* Timer/Counter 1 Control Register C */
#define TC16_TCNT1       _SFR_MEM16(0x84) /* Timer/Counter1  Bytes */
#define TC16_TCNT1L      _SFR_MEM8 (0x84) /* Timer/Counter1  Bytes LOW BYTE */
#define TC16_TCNT1H      _SFR_MEM8 (0x85) /* Timer/Counter1  Bytes HIGH BYTE */
#define TC16_ICR1        _SFR_MEM16(0x86) /* Timer/Counter1 Input Capture Register  Bytes */
#define TC16_ICR1L       _SFR_MEM8 (0x86) /* Timer/Counter1 Input Capture Register  Bytes LOW BYTE */
#define TC16_ICR1H       _SFR_MEM8 (0x87) /* Timer/Counter1 Input Capture Register  Bytes HIGH BYTE */
#define TC16_OCR1A       _SFR_MEM16(0x88) /* Timer/Counter1 Output Compare Register A  Bytes */
#define TC16_OCR1AL      _SFR_MEM8 (0x88) /* Timer/Counter1 Output Compare Register A  Bytes LOW BYTE */
#define TC16_OCR1AH      _SFR_MEM8 (0x89) /* Timer/Counter1 Output Compare Register A  Bytes HIGH BYTE */
#define TC16_OCR1B       _SFR_MEM16(0x8A) /* Timer/Counter1 Output Compare Register B  Bytes */
#define TC16_OCR1BL      _SFR_MEM8 (0x8A) /* Timer/Counter1 Output Compare Register B  Bytes LOW BYTE */
#define TC16_OCR1BH      _SFR_MEM8 (0x8B) /* Timer/Counter1 Output Compare Register B  Bytes HIGH BYTE */

/* TC2 - Timer/Counter, 8-bit Async (0x00) */
#define TC8_ASYNC_BASE   _SFR_MEM8 (0x00) /* TC8_ASYNC Base Address */
#define TC8_ASYNC_TIFR2  _SFR_MEM8 (0x37) /* Timer/Counter2 Interrupt Flag Register */
#define TC8_ASYNC_GTCCR  _SFR_MEM8 (0x43) /* General Timer/Counter Control Register */
#define TC8_ASYNC_TIMSK2 _SFR_MEM8 (0x70) /* Timer/Counter2 Interrupt Mask register */
#define TC8_ASYNC_TCCR2A _SFR_MEM8 (0xB0) /* Timer/Counter2 Control Register */
#define TC8_ASYNC_TCNT2  _SFR_MEM8 (0xB2) /* Timer/Counter2 */
#define TC8_ASYNC_OCR2A  _SFR_MEM8 (0xB3) /* Timer/Counter2 Output Compare Register */
#define TC8_ASYNC_ASSR   _SFR_MEM8 (0xB6) /* Asynchronous Status Register */

/* WDT - Watchdog Timer (0x00) */
#define WDT_BASE         _SFR_MEM8 (0x00) /* WDT Base Address */
#define WDT_WDTCR        _SFR_MEM8 (0x60) /* Watchdog Timer Control Register */

